//REPRO2   JOB  REPROJCL
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=A
//SYSIN    DD   *
         PRINT -
           INDATASET(Z05336.VSAMDS) -
           CHARACTER
